CREATE POLICY "allow all 1ffg0oo_0" ON storage.objects
    FOR SELECT TO public
        USING (bucket_id = 'images');

CREATE POLICY "allow all 1ffg0oo_1" ON storage.objects
    FOR INSERT TO public
        WITH CHECK (bucket_id = 'images');

INSERT INTO setting_types(setting_type)
    VALUES ('image'),
('link'),
('text'),
('richtext'),
('address'),
('phone'),
('percent');


INSERT INTO events_schema.categories(category_name)values('اقتصاد');

INSERT INTO events_schema.events(
    event_name,
    event_location,
    event_location_url,
    constructor_name,
    constructor_title,
    constructor_image,
    event_plan,
    event_goals,
    event_breif,
    event_description,
    event_video,
    event_date,
    event_start_time,
    event_end_time,
     event_hours,
    category_id,
    event_image
) values (
    'دورة تدريبية لبناء خطط الاعمال للشركات',
    'الرياض',
    'https://maps.app.goo.gl/GnNgWKsfSwACRxoi9',
    'أ / أحمد المنهبي ',
    'خبير اقتصادي',
    'initial/progs/single2.png',
    '[{
      title: "محاكاة عملية",
      breif: "تجربة عملية تفاعلية تمنحك الفرصة للتعلم من خلال محاكاة أوضاع وظروف العمل الحقيقية"
    },
    {
      title: "أدوات قياس",
      breif: "تعلم استخدام أدوات القياس الفعالة لتحليل أداء الشركة واتخاذ القرارات الاستراتيجية المبنية على البيانات"
    },
    {
      title: "نقاشات نشطة",
      breif: "المشاركة في نقاشات مفصلة وتبادل الأفكار والآراء مع المشاركين الآخرين لتعزيز التعلم وتوسيع المدارك"
    },
    {
      title: "شبكة علاقات",
      breif: "بناء علاقات قوية ومفيدة مع المشاركين والمحاضرين والخبراء في مجال الأعمال وتوسيع شبكتك المهنية"
    },
    {
      title: "نمذجة الابتكار بواسطة الذكاء الاصطناعي (AI)",
      breif: "استخدام تقنيات الذكاء الاصطناعي لتحليل البيانات واستخراج الصيحات وتوجيه عملية اتخاذ القرارات للابتكار في المشاريع"
    }]',
    '[
    "توفير مجموعة متنوعة من الدورات التدريبية المكثفة لتطوير مهارات الإدارة والتسويق والتمويل والابتكار في بناء خطط الأعمال الناجحة.",
    "تعزيز قدرات المشاركين على استخدام أدوات قياس الأداء وتحليل البيانات لتحقيق تحسين مستمر واتخاذ القرارات الاستراتيجية المبنية على الحقائق.",
    "تطوير مهارات التواصل والتفاوض والعمل الجماعي من خلال المشاركة في نقاشات نشطة ومحاكاة عملية لتعزيز التعلم وبناء شبكات علاقات مهنية قوية.",
    "تعريف المشاركين بأحدث تقنيات الذكاء الاصطناعي واستخدامها في نمذجة الابتكار وتحليل البيانات لتحقيق تفوق ريادي في مجالات الأعمال المختلفة",
    "تمكين المشاركين من وضع خطط استراتيجية شاملة للمشاريع وتحليل السوق واستراتيجية التسويق وتخطيط الموارد وإدارة المخاطر لتحقيق النجاح المستدام في الأعمال التجارية"
  ]',
    ' تركز الورشة على تطوير وتعزيز الإبداع والابتكار الريادي والتفوق بأدوات الذكاء الاصطناعي والعمل على تشجيع التفكير الخلاق من خلال الاستثمار المستقبلي لتحقيق أفكار جديدة وجريئة تتوافق مع تطلعات المستقبل',
   '<p>تركز الورشة على تطوير وتعزيز الإبداع والابتكار الريادي والتفوق بأدوات الذكاء الاصطناعي والعمل على تشجيع التفكير الخلاق من خلال الاستثمار المستقبلي لتحقيق أفكار جديدة وجريئة تتوافق مع تطلعات المستقبل.</p>

<p>إدارة العمليات هو مساق مجاني مقدّم من إدراك يساعد المتعلم على استيعاب أهم المفاهيم والمهام الرئيسية المتعلقة بموضوع إدارة العمليات، ليتمكن من شق طريقه المهني في هذا المجال بنجاح وممارسة مسؤولياته وصلاحياته بالشكل الصحيح وفي الوقت والمكان المناسبين. إضافةً إلى ذلك، يوضح المساق أهمية إدارة العمليات والأجزاء الرئيسية فيها وكيفية تصميم وتطوير المنتجات والخدمات في المؤسسة.</p>

<p>تكمن أهمية إدارة العمليات في تحقيق التكامل بين الأقسام المختلفة للمؤسسة، وتُعَد إدارة العمليات من المواضيع الهامة التي تُعنى بها المؤسسات والشركات الكبرى تدور تفاصيل عملها حول كيفية تقديم الخدمات وإنتاج البضائع والسلع لتشمل عدداً من الجوانب، ابتداءً من تصميم المنتجات وإدارة المستودعات والمخازن وحتى تحسين وتطوير أداء إدارة العمليات في الشركات.</p>

<p>تُمثل إدارة العمليات حلقة الوصل بين جميع الوظائف داخل المؤسسات والشركات الكبرى، ومن الضروري جداً الوعي التام بجميع مهام إدارة العمليات ومسؤوليات مدير العمليات كي تسير الوظائف ب
',
'IG4-i4XTFr0',
'09/09/2023',
'04:00:00',
'09:00:00',
'12',
1,
'initial/progs/p2.webp'

),
(
    'صناعة الريادة والابتكار في المنظمات والشركات',
    'الرياض',
    'https://maps.app.goo.gl/GnNgWKsfSwACRxoi9',
    'أ / أحمد المنهبي ',
    'خبير اقتصادي',
    'initial/progs/single2.png',
    '[{
      title: "محاكاة عملية",
      breif: "تجربة عملية تفاعلية تمنحك الفرصة للتعلم من خلال محاكاة أوضاع وظروف العمل الحقيقية"
    },
    {
      title: "أدوات قياس",
      breif: "تعلم استخدام أدوات القياس الفعالة لتحليل أداء الشركة واتخاذ القرارات الاستراتيجية المبنية على البيانات"
    },
    {
      title: "نقاشات نشطة",
      breif: "المشاركة في نقاشات مفصلة وتبادل الأفكار والآراء مع المشاركين الآخرين لتعزيز التعلم وتوسيع المدارك"
    },
    {
      title: "شبكة علاقات",
      breif: "بناء علاقات قوية ومفيدة مع المشاركين والمحاضرين والخبراء في مجال الأعمال وتوسيع شبكتك المهنية"
    },
    {
      title: "نمذجة الابتكار بواسطة الذكاء الاصطناعي (AI)",
      breif: "استخدام تقنيات الذكاء الاصطناعي لتحليل البيانات واستخراج الصيحات وتوجيه عملية اتخاذ القرارات للابتكار في المشاريع"
    }]',
    '[
    "توفير مجموعة متنوعة من الدورات التدريبية المكثفة لتطوير مهارات الإدارة والتسويق والتمويل والابتكار في بناء خطط الأعمال الناجحة.",
    "تعزيز قدرات المشاركين على استخدام أدوات قياس الأداء وتحليل البيانات لتحقيق تحسين مستمر واتخاذ القرارات الاستراتيجية المبنية على الحقائق.",
    "تطوير مهارات التواصل والتفاوض والعمل الجماعي من خلال المشاركة في نقاشات نشطة ومحاكاة عملية لتعزيز التعلم وبناء شبكات علاقات مهنية قوية.",
    "تعريف المشاركين بأحدث تقنيات الذكاء الاصطناعي واستخدامها في نمذجة الابتكار وتحليل البيانات لتحقيق تفوق ريادي في مجالات الأعمال المختلفة",
    "تمكين المشاركين من وضع خطط استراتيجية شاملة للمشاريع وتحليل السوق واستراتيجية التسويق وتخطيط الموارد وإدارة المخاطر لتحقيق النجاح المستدام في الأعمال التجارية"
  ]',
    ' تركز الورشة على تطوير وتعزيز الإبداع والابتكار الريادي والتفوق بأدوات الذكاء الاصطناعي والعمل على تشجيع التفكير الخلاق من خلال الاستثمار المستقبلي لتحقيق أفكار جديدة وجريئة تتوافق مع تطلعات المستقبل',
   '<p>تركز الورشة على تطوير وتعزيز الإبداع والابتكار الريادي والتفوق بأدوات الذكاء الاصطناعي والعمل على تشجيع التفكير الخلاق من خلال الاستثمار المستقبلي لتحقيق أفكار جديدة وجريئة تتوافق مع تطلعات المستقبل.</p>

<p>إدارة العمليات هو مساق مجاني مقدّم من إدراك يساعد المتعلم على استيعاب أهم المفاهيم والمهام الرئيسية المتعلقة بموضوع إدارة العمليات، ليتمكن من شق طريقه المهني في هذا المجال بنجاح وممارسة مسؤولياته وصلاحياته بالشكل الصحيح وفي الوقت والمكان المناسبين. إضافةً إلى ذلك، يوضح المساق أهمية إدارة العمليات والأجزاء الرئيسية فيها وكيفية تصميم وتطوير المنتجات والخدمات في المؤسسة.</p>

<p>تكمن أهمية إدارة العمليات في تحقيق التكامل بين الأقسام المختلفة للمؤسسة، وتُعَد إدارة العمليات من المواضيع الهامة التي تُعنى بها المؤسسات والشركات الكبرى تدور تفاصيل عملها حول كيفية تقديم الخدمات وإنتاج البضائع والسلع لتشمل عدداً من الجوانب، ابتداءً من تصميم المنتجات وإدارة المستودعات والمخازن وحتى تحسين وتطوير أداء إدارة العمليات في الشركات.</p>

<p>تُمثل إدارة العمليات حلقة الوصل بين جميع الوظائف داخل المؤسسات والشركات الكبرى، ومن الضروري جداً الوعي التام بجميع مهام إدارة العمليات ومسؤوليات مدير العمليات كي تسير الوظائف ب
',
'IG4-i4XTFr0',
'09/09/2023',
'04:00:00',
'09:00:00',
'12',
1,
'initial/progs/p2.webp'

);